---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
source: html/288aab7f-2833-c194-8112-af6248954c84.htm
---
# NonContinuousRailStructure Members

Creates and appends a new Non-Continuous Rail to the Rail Structure.
 The new Non-Continuous Rail will have the given name, height and offset.
 It will have default profile and material ElementIds.